# MUX

## 📌 Description
3 input 1 output MUX 회로  기본적으로 input은 다양하게 둘 수 있다.
input에는 a,b,sel 로 sel는 어떤 입력을 출력할지 결정한다.
input의 개수에 따라 sel의 비트도 달라진다. ex> 입력 2개 == 1비트 0,1 표현가능 , 입력 4개 2비트 00,01... 으로 표현해야한다.


## 🔢 Truth Table

###2:1MUX
| a | b | sel | y |
|:-:|:-:|:---:|:-:|
| 0 | 0 |  0  | 0 |
| 0 | 0 |  1  | 0 |
| 0 | 1 |  0  | 0 |
| 0 | 1 |  1  | 1 |
| 1 | 0 |  0  | 1 |
| 1 | 0 |  1  | 0 |
| 1 | 1 |  0  | 1 |
| 1 | 1 |  1  | 1 |

###4:1MUX
| # | sel | a | b | c | d | Expected y |
|:-:|:---:|:-:|:-:|:-:|:-:|:----------:|
| 1 | 00  | 1 | 0 | 0 | 0 |     1      |
| 2 | 01  | 0 | 1 | 0 | 0 |     1      |
| 3 | 10  | 0 | 0 | 1 | 0 |     1      |
| 4 | 11  | 0 | 0 | 0 | 1 |     1      |
| 5 | 00  | 0 | 1 | 1 | 1 |     0      |
| 6 | 01  | 1 | 0 | 1 | 1 |     0      |
| 7 | 10  | 1 | 1 | 0 | 1 |     0      |
| 8 | 11  | 1 | 1 | 1 | 0 |     0      |

## 💻 Implementation

### 2:1MUX

```
case(sel)
      1'b1:y=b;
      1'b0:y=a;
endcase
``` 
case 말고도 if 또는 assign 구문으로도 구현 가능하다.

###4:1MUX

 '''case(sel)
      
      2'b00:y=a;
      2'b01:y=b;
      2'b10:y=c;
      2'b11:y=d;
      
    endcase
'''
    

## 📂 Files
- `design2:1.sv` — MUX2:1 모듈
- `design4:1.sv` — MUX4:1 모듈
- `testbench2:1.sv` —  테스트벤치
- `testbench4:1.sv`

## ✅ Simulation Result

###2:1MUX

| # | sel | a | b | Expected y | Actual y | Result |
|:-:|:---:|:-:|:-:|:----------:|:--------:|:------:|
| 1 |  0  | 0 | 1 |     0      |    0     |   ✅   |
| 2 |  1  | 0 | 1 |     1      |    1     |   ✅   |
| 3 |  0  | 1 | 0 |     1      |    1     |   ✅   |
| 4 |  1  | 1 | 0 |     0      |    0     |   ✅   |


###4:1MUX

| # | sel | a | b | c | d | Expected y | Actual y | Result |
|:-:|:---:|:-:|:-:|:-:|:-:|:----------:|:--------:|:------:|
| 1 | 00  | 1 | 0 | 0 | 0 |     1      |    1     |   ✅   |
| 2 | 01  | 0 | 1 | 0 | 0 |     1      |    1     |   ✅   |
| 3 | 10  | 0 | 0 | 1 | 0 |     1      |    1     |   ✅   |
| 4 | 11  | 0 | 0 | 0 | 1 |     1      |    1     |   ✅   |
| 5 | 00  | 0 | 1 | 1 | 1 |     0      |    0     |   ✅   |
| 6 | 01  | 1 | 0 | 1 | 1 |     0      |    0     |   ✅   |
| 7 | 10  | 1 | 1 | 0 | 1 |     0      |    0     |   ✅   |
| 8 | 11  | 1 | 1 | 1 | 0 |     0      |    0     |   ✅   |
